erp3l/src/Catalogs/ШаблоныСверкиВГО/ШаблоныСверкиВГО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныСверкиВГО</name>
  <attributes>
    <name>БезТрансляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаИтогов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАналитикуСчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОпределятьСебестоимостьПоВидуВыручки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовЭлиминации</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьНулевыеРасхождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентЗавершенияСверкиОрганизации</name>
    <comment>Плановое количество дней для завершения сверки по организации</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ИспользоватьСчетаАНеКорреспонденцииДляРасхожденийВГО</name>
    <comment>Истина - счета, ложь - корреспонденции</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_НеУчитыватьКорреспонденцииДляРассчетаРасхождений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_НомерСубконтоДебиторСчетСписанияРасхождений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_НомерСубконтоДебиторСчетУрегулирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_НомерСубконтоДебиторСчетЭлиминации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_НомерСубконтоКредиторСчетСписанияРасхождений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_НомерСубконтоКредиторСчетУрегулирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_НомерСубконтоКредиторСчетЭлиминации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_НомерСубконтоРазделаВГОСчетСписанияРасхождений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_НомерСубконтоРазделаВГОСчетУрегулирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_НомерСубконтоРазделаВГОСчетЭлиминации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_РегламентРешенияСпора</name>
    <comment>Плановое количество дней для решения спорной ситуации</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_РегламентСверкиРасхождения</name>
    <comment>Плановое количество дней для проведения сверки одной строки расхождения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ТехническийСчетДляЭлиминации</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ТехническийСчетСписанияРасхождений</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ТехническийСчетУрегулирования</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТрансляцияПлановСчетовНаМСФОДляЭлиминации</name>
    <attributes>
      <name>ПланСчетовИсточник</name>
      <type>
        <types>CatalogRef.ПланыСчетовБД</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонТрансляцииСчетов</name>
      <type>
        <types>CatalogRef.ШаблоныТрансляций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехническиеСчета</name>
    <attributes>
      <name>ТипСчета</name>
      <type>
        <types>EnumRef.ТипыТехническихСчетовДляСверкиЭлиминации</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполненияСубконто1</name>
      <type>
        <types>EnumRef.СпособыЗаполненияЗначенийСубконтоСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполненияСубконто2</name>
      <type>
        <types>EnumRef.СпособыЗаполненияЗначенийСубконтоСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполненияСубконто3</name>
      <type>
        <types>EnumRef.СпособыЗаполненияЗначенийСубконтоСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеЗаполненияСубконто1</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеЗаполненияСубконто2</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеЗаполненияСубконто3</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/РазделыСверкиВГО/РазделыСверкиВГО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РазделыСверкиВГО</name>
  <comment>Настройки сверки и элиминации ВГО</comment>
  <owners>Catalog.ШаблоныСверкиВГО</owners>
  <attributes>
    <name>СпособЭлиминации</name>
    <type>
      <types>EnumRef.СпособыЭлиминации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРаскрытия</name>
    <type>
      <types>CatalogRef.ГруппыАналитикСверкиВГО</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗначения</name>
    <type>
      <types>EnumRef.ВидыЗначенийВГО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорогСущественности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДанныхФСДЗакупки</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДанныхФСДСебестоимостьПродаж</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьДопАналитики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРасхожденияДляАвтоурегулирования</name>
    <comment>Подставляется в документ урегулирования, который формируется при автоматическом урегулировании. Определяет проводку для автоурегулирования.</comment>
    <type>
      <types>CatalogRef.ПричиныРасхожденийВГО</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСверять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособАвтоматическогоУрегулирования</name>
    <type>
      <types>EnumRef.СпособыАвтоматическогоУрегулирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширеннаяНастройкаИсточниковДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсточникиДанных</name>
    <attributes>
      <name>ИсточникДанных</name>
      <type>
        <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОпределенияНаправленияУчета</name>
      <comment>Дебет или кредит</comment>
      <type>
        <types>EnumRef.СпособОпределенияНаправленияУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьВид</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбъекта</name>
      <type>
        <types>EnumRef.СпособыПолученияОперандов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>CatalogRef.ВидыОтчетов</types>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТаблицы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НастройкиИсточникаДанных</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проводки</name>
    <attributes>
      <name>СчетДт</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКт</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентОтСуммыРасхождения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСубконтоДт1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСубконтоДт2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСубконтоДт3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСубконтоКт1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСубконтоКт2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСубконтоКт3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполненияСубконтоДт1</name>
      <type>
        <types>EnumRef.СпособыЗаполненияСубконтоВГО</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполненияСубконтоДт2</name>
      <type>
        <types>EnumRef.СпособыЗаполненияСубконтоВГО</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполненияСубконтоДт3</name>
      <type>
        <types>EnumRef.СпособыЗаполненияСубконтоВГО</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполненияСубконтоКт1</name>
      <type>
        <types>EnumRef.СпособыЗаполненияСубконтоВГО</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполненияСубконтоКт2</name>
      <type>
        <types>EnumRef.СпособыЗаполненияСубконтоВГО</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполненияСубконтоКт3</name>
      <type>
        <types>EnumRef.СпособыЗаполненияСубконтоВГО</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаВГОДт1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаВГОДт2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаВГОДт3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаВГОКт1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаВГОКт2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаВГОКт3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникДанныхДт</name>
      <type>
        <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникДанныхКт</name>
      <type>
        <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СверяемыеАналитики</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФормулаРасхождения</name>
      <comment>0-Расхождение,1-ВключитьСПлюсом,2-ВключитьСминусом,3-Справочно(НеВключать)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/ШаблоныСверкиВГО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
// Проверяем возможность редактировать шаблона сверки.
// На этот шаблон не должно быть ссылок в 
// справочниках "ВерсииРегламентаПодготовкиОтчетности"
// или "ЭтапыПроцессов"
//
Функция МожноРедактироватьОбъект(ОбъектШаблон) Экспорт
	
	Возврат Истина;
КонецФункции

// Для указанного шаблона сверки получить значение счета и правил его заполнения.
// Параметры:
//  ШаблонСверки - СправочникСсылка.ШаблоныСверкиВГО - шаблон сверки,
//					для которого необходимо получить счет.
//  ТипСчета	 - ПеречислениеСсылка.ТипыТехническихСчетовДляСверкиЭлиминации - тип счета.
// 
// Возвращаемое значение:
//	 - Структура:
//   	- Счет - СправочникСсылка.СчетаБД - если счет найден. ПустаяСсылка() - если счет не найден.
//		- СпособЗаполненияСубконто1..3 - ПеречислениеСсылка.СпособыЗаполненияЗначенийСубконтоСчета - способ заполнения.
//		- ЗначениеЗаполненияСубконто1..3 - Любая ссылка - Значение если способ заполнения == "Фиксированное значение", Иначе - Неопределено.
//
Функция ПолучитьОписаниеТехническогоСчетаУрегулирования(ШаблонСверки, ТипСчета) Экспорт
	ПравилоЗаполненияСчета = Новый Структура;
	ПравилоЗаполненияСчета.Вставить("Счет", Справочники.СчетаБД.ПустаяСсылка());
	Для НомерСубконто = 1 По 3 Цикл
		ПравилоЗаполненияСчета.Вставить("СпособЗаполненияСубконто" + НомерСубконто,
			Перечисления.СпособыЗаполненияЗначенийСубконтоСчета.ПустаяСсылка());
		ПравилоЗаполненияСчета.Вставить("ЗначениеЗаполненияСубконто" + НомерСубконто,
			Неопределено);
	КонецЦикла;
	
	Строка_ = ШаблонСверки.ТехническиеСчета.Найти(ТипСчета, "ТипСчета");
	Если Строка_ = Неопределено Тогда
		Возврат Справочники.СчетаБД.ПустаяСсылка();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ПравилоЗаполненияСчета, Строка_);
		
	Возврат ПравилоЗаполненияСчета;
КонецФункции

// Возвращает два флага, используются разделы сверки для элиминации по проводкам,
//  используются разделы сверки для элиминации по показателям.
//
// Параметры:
//  ШаблонСверки - СправочникСсылка.ШаблоныСверкиВГО - шаблон для которого 
//					нужно получить данные.
// 
// Возвращаемое значение:
//   - Структура:
//		- Проводки - Булево - используется элиминация проводок;
//		- Показатели - Булево - используется элиминация показателей.
//
Функция ПроверитьСпособЭлиминацииПроводокПоказателей(ШаблонСверки) Экспорт
	
	Результат = Новый Структура("Проводки, Показатели", Ложь, Ложь);
	
	Если ЗначениеЗаполнено(ШаблонСверки) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕстьNULL(МАКСИМУМ(РазделыСверкиВГО.СпособЭлиминации = ЗНАЧЕНИЕ(Перечисление.СпособыЭлиминации.ЭлиминацияПоказателейОтчетов)), ЛОЖЬ) КАК Показатели,
		|	ЕстьNULL(МАКСИМУМ(РазделыСверкиВГО.СпособЭлиминации <> ЗНАЧЕНИЕ(Перечисление.СпособыЭлиминации.ЭлиминацияПоказателейОтчетов)), ЛОЖЬ) КАК Проводки
		|ИЗ
		|	Справочник.РазделыСверкиВГО КАК РазделыСверкиВГО
		|ГДЕ
		|	НЕ РазделыСверкиВГО.ПометкаУдаления
		|	И РазделыСверкиВГО.Владелец = &ШаблонСверки
		|	И РазделыСверкиВГО.СпособЭлиминации <> ЗНАЧЕНИЕ(Перечисление.СпособыЭлиминации.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("ШаблонСверки", ШаблонСверки);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции


#КонецЕсли
